{
  "projects": [
    {
      "id": "sophia-college-pr",
      "title": "Sophia College PR & Social Design",
      "image": "/images/projects/sophia-college.jpg",
      "size": "col-span-6 row-span-1",
      "description": "Internal communications design and social media strategy for Sophia College",
      "longDescription": "As Head of PR at Sophia College (May 2023 – April 2024), I led the design and rollout of internal communications assets, including posters, email visuals, and Instagram content. This work was part of a broader strategy to keep students informed, engaged, and excited about campus events. My goal was to make information instantly clear while keeping the visuals chic and student-friendly. Most of the graphics leaned into a minimal, feminine aesthetic—centered around Sophia's signature peach and green, with splashes of beige and brown tones.",
      "category": "Brand Design & Social Media",
      "duration": "11 months",
      "technologies": ["Adobe Creative Suite", "Canva", "Instagram", "Brand Design"],
      "features": [
        "Minimal, feminine aesthetic design system",
        "Campus event promotion materials",
        "Student-focused visual communication",
        "Social media content with trending audios"
      ]
    },
    {
      "id": "offsuit-boston",
      "title": "Offsuit Boston: Speakeasy Social Media Concept",
      "image": "/images/projects/offsuit-boston.jpg",
      "size": "col-span-6 row-span-1",
      "description": "Dark, moody social media concept for a hidden speakeasy behind a downtown coffee shop",
      "longDescription": "At Northeastern, I created a social media concept for Offsuit Boston, a hidden speakeasy tucked behind a downtown coffee shop. The brief was to choose an existing business and develop content that captured its brand essence while appealing to potential customers. I leaned into a dark, moody aesthetic to reflect Offsuit's intimate and elusive vibe. The graphics featured cocktail details, bar textures, and shadowy lighting—evoking the speakeasy mystique while still drawing intrigue.",
      "category": "Social Media Strategy",
      "duration": "1 month",
      "technologies": ["Social Media Design", "Brand Conceptualization", "Visual Storytelling"],
      "features": [
        "Dark, moody aesthetic design",
        "Cocktail-focused visual content",
        "Mysterious and alluring brand tone",
        "Speakeasy atmosphere capture"
      ]
    },
    {
      "id": "campus-flyers",
      "title": "Campus Flyers & Poster Design",
      "image": "/images/projects/campus-flyers.jpg",
      "size": "col-span-2 row-span-2",
      "description": "Collection of event posters and promotional materials for campus activities",
      "longDescription": "Across my undergrad extracurriculars and now at Northeastern through class projects, I've built a collection of posters and flyers designed for events, awareness campaigns, and campus activations. These range from last-minute club promotions to structured assignment deliverables. Each piece was shaped by its purpose—some loud and playful, others clean and informative. I focused on clarity with character, using bold type, intuitive layouts, and color choices that matched tone and audience.",
      "category": "Print & Digital Design",
      "duration": "Ongoing",
      "technologies": ["Print Design", "Typography", "Layout Design", "Adobe Creative Suite"],
      "features": [
        "Bold typography and layouts",
        "Audience-specific design approaches",
        "Event promotion materials",
        "Clear message communication"
      ]
    },
    {
      "id": "cbma-content",
      "title": "Canada Black Music Archives: Content Concept Deck",
      "image": "/images/projects/cbma-content.jpg",
      "size": "col-span-2 row-span-2",
      "description": "Visual content deck for preserving and promoting Black musical history",
      "longDescription": "At Northeastern, I worked on a content design project for the Canada Black Music Archives (CBMA), an emerging archive based in Toronto dedicated to preserving Black musical history. The organization partnered with our class to help shape a fresh, flexible content deck for social and digital use. Working within a strict brand kit, I explored layered overlays, textured backgrounds, and bold text treatments to bring energy and rhythm to the visual language. Many of the graphics incorporated music elements—vinyls, waveforms, and vintage mic silhouettes—with a retro jazz-inspired vibe running through the entire deck.",
      "category": "Cultural Heritage Design",
      "duration": "3 months",
      "technologies": ["Brand Guidelines", "Social Media Design", "Cultural Design", "Digital Content"],
      "features": [
        "Retro jazz-inspired visual language",
        "Music element incorporation",
        "Cultural reverence with modern appeal",
        "Flexible content deck system"
      ]
    },
    {
      "id": "short-form-video",
      "title": "Short-Form Video & Reels Collection",
      "image": "/images/projects/short-form-video.jpg",
      "size": "col-span-2 row-span-1",
      "description": "Curated collection of Instagram reels and short-form video content",
      "longDescription": "This is a curated set of short-form videos and reels made for Instagram-first audiences. Most are quick, punchy edits crafted with trending audios, timed transitions, and visuals that hook scrollers fast. These videos are built to entertain, engage, and reflect the aesthetic of the brand they represent. I believe short-form video is where the scroll stops and connection begins. Whether it's a brand teaser or an event recap, I create videos that let the vibe speak before the caption does.",
      "category": "Video Content Creation",
      "duration": "Ongoing",
      "technologies": ["Video Editing", "Instagram Reels", "Trending Audio Integration", "Visual Storytelling"],
      "features": [
        "Trending audio integration",
        "Scroll-stopping visual hooks",
        "Brand-specific aesthetic adaptation",
        "Quick, punchy editing style"
      ]
    },
    {
      "id": "we-will-lead-africa",
      "title": "We Will Lead Africa: Digital Design for Global Visibility",
      "image": "/images/projects/we-will-lead-africa.jpg",
      "size": "col-span-2 row-span-2",
      "description": "Social graphics championing Black leadership across Africa and the diaspora",
      "longDescription": "As part of a class project for my Digital Marketing course at Northeastern, I created social graphics for We Will Lead Africa, an organization that champions Black leadership across the continent and diaspora. These designs put faces front and center. Using bold, modern typography and a color palette inspired by African heritage, I aimed to give the movement a global-ready visual identity. Text became the bridge between culture and contemporary impact—making space for strong voices to shine, while drawing in international audiences with design that demands attention.",
      "category": "Global Movement Design",
      "duration": "2 months",
      "technologies": ["Social Media Design", "Global Branding", "Cultural Design", "Typography"],
      "features": [
        "Bold, modern typography",
        "African heritage-inspired color palette",
        "Face-forward design approach",
        "Global-ready visual identity"
      ]
    }
  ]
}
